<template>
  <div class="about">
    <h1>This is an about page</h1>
    <hr>
    <p>Проект T3M использует Vuex как единую state базу. Мы подгружаем примеры товаров-котов из локального json и записываем все в store. Css библиотека Buefy(bulma)</p>
    <p>Фильтрация происходит за счет метода filtred, прогоняя массив для отрисовки через множество if statments пока заданный фильтр не найдет инструкции к исполнению. Присутсвует пагинация 10 карточек на страницу</p>
    <p>Основной отличительной идеей является левая панель, которая реагирует на выбранный товар. Если нажать на любую карточку с главного экрана, помимо того, что вас перекинет на ее личную страницу, так еще и приложение разблокирует быстрый переходы через новые кнопки Cat и Edit. Хотя это не отменяет возможности через адрессную строку попасть на любой интерфейс любого кота, дрстаточно вбить id.</p>
    <p>Реализована валидация из тз</p>
    <p>В остальном приложение работает как обычный crud spa на vue, с сеттерами, computed, methods и всем необходимым.</p>
    <p>Во время выполнения задания я не реализовал возможность добавления фотогрфии, так как никогда не работал с ними и меня подгонял deadline</p>
    <p>TODO: Разработка более легкого способа фильтрования</p>
  </div>
</template>

<style>
.about{
  width: 90%
}
</style>
